/**
 * 统一错误代码定义
 */
export default {
  // 10000 - 99999 业务操作错误
  10000: '参数校验异常',
  10001: '该属性已被使用，请更换',
  10002: '填写验证码有误',
  10003: '用户名密码有误',
  10004: '该账号已禁用，请联系管理员',
  10005: '重置密码失败',
  10006: '非法操作：该节点仅支持目录类型父节点',
  10007: '非法操作：节点类型无法直接转换',
  10008: '该角色存在关联用户，请先删除关联用户',
  10009: '该部门存在关联用户，请先删除关联用户',
  10010: '该部门存在关联角色，请先删除关联角色',
  10015: '该部门存在子部门，请先删除子部门',
  10011: '旧密码与原密码不一致',
  10012: '如想下线自身可右上角退出',
  10013: '不允许下线该用户',
  10014: '父级菜单不存在',
  10016: '系统内置功能，不可删除',
  10017: '发送验证码错误',
  10018: '注册失败',
  10019: '上传文件路径失败',
  10020: '用户增加积分失败',
  10021: '非法操作，您不是本站用户，无权下载！',
  10022: '扣除积分失败！',
  10023: '上传主图失败！',

  // token相关
  11001: '登录无效或无权限访问',
  11002: '登录身份已过期',
  11003: '无权限，请联系管理员申请权限',

  // OSS相关
  20001: '当前创建的文件或目录已存在',
};
